CSI API ETABS v1
cGroup.GetGroup_1 Method
 Retrieves the group data. Primarily for ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGroup_1(
	string Name,
	ref int color,
	ref bool SpecifiedForSelection,
	ref bool SpecifiedForSectionCutDefinition,
	ref bool SpecifiedForSteelDesign,
	ref bool SpecifiedForConcreteDesign,
	ref bool SpecifiedForAluminumDesign,
	ref bool SpecifiedForStaticNLActiveStage,
	ref bool SpecifiedForAutoSeismicOutput,
	ref bool SpecifiedForAutoWindOutput,
	ref bool SpecifiedForMassAndWeight,
	ref bool SpecifiedForSteelJoistDesign,
	ref bool SpecifiedForWallDesign,
	ref bool SpecifiedForBasePlateDesign,
	ref bool SpecifiedForConnectionDesign
)
Function GetGroup_1 (
	Name As String,
	ByRef color As Integer,
	ByRef SpecifiedForSelection As Boolean,
	ByRef SpecifiedForSectionCutDefinition As Boolean,
	ByRef SpecifiedForSteelDesign As Boolean,
	ByRef SpecifiedForConcreteDesign As Boolean,
	ByRef SpecifiedForAluminumDesign As Boolean,
	ByRef SpecifiedForStaticNLActiveStage As Boolean,
	ByRef SpecifiedForAutoSeismicOutput As Boolean,
	ByRef SpecifiedForAutoWindOutput As Boolean,
	ByRef SpecifiedForMassAndWeight As Boolean,
	ByRef SpecifiedForSteelJoistDesign As Boolean,
	ByRef SpecifiedForWallDesign As Boolean,
	ByRef SpecifiedForBasePlateDesign As Boolean,
	ByRef SpecifiedForConnectionDesign As Boolean
) As Integer
Dim instance As cGroup
Dim Name As String
Dim color As Integer
Dim SpecifiedForSelection As Boolean
Dim SpecifiedForSectionCutDefinition As Boolean
Dim SpecifiedForSteelDesign As Boolean
Dim SpecifiedForConcreteDesign As Boolean
Dim SpecifiedForAluminumDesign As Boolean
Dim SpecifiedForStaticNLActiveStage As Boolean
Dim SpecifiedForAutoSeismicOutput As Boolean
Dim SpecifiedForAutoWindOutput As Boolean
Dim SpecifiedForMassAndWeight As Boolean
Dim SpecifiedForSteelJoistDesign As Boolean
Dim SpecifiedForWallDesign As Boolean
Dim SpecifiedForBasePlateDesign As Boolean
Dim SpecifiedForConnectionDesign As Boolean
Dim returnValue As Integer
returnValue = instance.GetGroup_1(Name,
	color, SpecifiedForSelection, SpecifiedForSectionCutDefinition,
	SpecifiedForSteelDesign, SpecifiedForConcreteDesign,
	SpecifiedForAluminumDesign, SpecifiedForStaticNLActiveStage,
	SpecifiedForAutoSeismicOutput,
	SpecifiedForAutoWindOutput, SpecifiedForMassAndWeight,
	SpecifiedForSteelJoistDesign, SpecifiedForWallDesign,
	SpecifiedForBasePlateDesign, SpecifiedForConnectionDesign)
int GetGroup_1(
	String^ Name,
	int% color,
	bool% SpecifiedForSelection,
	bool% SpecifiedForSectionCutDefinition,
	bool% SpecifiedForSteelDesign,
	bool% SpecifiedForConcreteDesign,
	bool% SpecifiedForAluminumDesign,
	bool% SpecifiedForStaticNLActiveStage,
	bool% SpecifiedForAutoSeismicOutput,
	bool% SpecifiedForAutoWindOutput,
	bool% SpecifiedForMassAndWeight,
	bool% SpecifiedForSteelJoistDesign,
	bool% SpecifiedForWallDesign,
	bool% SpecifiedForBasePlateDesign,
	bool% SpecifiedForConnectionDesign
)
abstract GetGroup_1 :
        Name : string *
        color : int byref *
        SpecifiedForSelection : bool byref *
        SpecifiedForSectionCutDefinition : bool byref *
        SpecifiedForSteelDesign : bool byref *
        SpecifiedForConcreteDesign : bool byref *
        SpecifiedForAluminumDesign : bool byref *
        SpecifiedForStaticNLActiveStage : bool byref *
        SpecifiedForAutoSeismicOutput : bool byref *
        SpecifiedForAutoWindOutput : bool byref *
        SpecifiedForMassAndWeight : bool byref *
        SpecifiedForSteelJoistDesign : bool byref *
        SpecifiedForWallDesign : bool byref *
        SpecifiedForBasePlateDesign : bool byref *
        SpecifiedForConnectionDesign : bool byref -> int
Parameters
Name
Type: System.String
This is the name of an existing group.
color
Type: System.Int32
The display color for the group specified as a Integer.
SpecifiedForSelection
Type: System.Boolean
This item is True if the group is specified to be used for selection; otherwise it is False.
SpecifiedForSectionCutDefinition
Type: System.Boolean
This item is True if the group is specified to be used for defining section cuts; otherwise it is False.
SpecifiedForSteelDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining steel frame design groups; otherwise it is False.
SpecifiedForConcreteDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining concrete frame design groups; otherwise it is False.
SpecifiedForAluminumDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining aluminum frame design groups; otherwise it is False.
SpecifiedForStaticNLActiveStage
Type: System.Boolean
This item is True if the group is specified to be used for defining stages for nonlinear static analysis; otherwise it is False.
SpecifiedForAutoSeismicOutput
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto seismic loads; otherwise it is False.
SpecifiedForAutoWindOutput
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto wind loads; otherwise it is False.
SpecifiedForMassAndWeight
Type: System.Boolean
This item is True if the group is specified to be used for reporting group masses and weight; otherwise it is False.
SpecifiedForSteelJoistDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining steel joist design groups; otherwise it is False.
SpecifiedForWallDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining wall design groups; otherwise it is False.
SpecifiedForBasePlateDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining base plate design groups; otherwise it is False.
SpecifiedForConnectionDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining connection design groups; otherwise it is False.
Return Value
Type: Int32
Returns zero if the group data is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Color as Integer
       Dim SpecifiedForSelection as Boolean
       Dim SpecifiedForSectionCutDefinition as Boolean
       Dim SpecifiedForSteelDesign as Boolean
       Dim SpecifiedForConcreteDesign as Boolean
       Dim SpecifiedForAluminumDesign as Boolean
       Dim SpecifiedForStaticNLActiveStage as Boolean
       Dim SpecifiedForAutoSeismicOutput as Boolean
       Dim SpecifiedForAutoWindOutput as Boolean
       Dim SpecifiedForMassAndWeight as Boolean
       Dim SpecifiedForSteelJoistDesign as Boolean
       Dim SpecifiedForWallDesign as Boolean
       Dim SpecifiedForBasePlateDesign as Boolean
       Dim SpecifiedForConnectionDesign as Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'define new group
       ret = SapModel.GroupDef.SetGroup_1("Group1", -1, True)
   'get group data
       ret = SapModel.GroupDef.GetGroup_1("Group1", Color, SpecifiedForSelection, SpecifiedForSectionCutDefinition, SpecifiedForSteelDesign, SpecifiedForConcreteDesign, SpecifiedForAluminumDesign, SpecifiedForStaticNLActiveStage, SpecifiedForAutoSeismicOutput, SpecifiedForAutoWindOutput, SpecifiedForMassAndWeight, SpecifiedForSteelJoistDesign, SpecifiedForWallDesign, SpecifiedForBasePlateDesign, SpecifiedForConnectionDesign)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cGroup Interface
ETABSv1 Namespace